Roesetta_Stone_Translation.org
#+INCLUDE: theme/style.org 
#+TITLE: Rosetta Stone - English/Portuguese Technical Terminology 
#+DESCRIPTION: Dictionary about English/Portuguese technical terminology organized by topic. 
#+AUTHOR:      
#+STARTUP: content 

* Technical Terminology - English/Portuguese 

|----------------------------------------+---------------------------------------------------------------------+---|
| English                                | Portuguese                                                          |   |
|----------------------------------------+---------------------------------------------------------------------+---|
| kernel                                 | núcleo ou núcleo de sistema operacional                             |   |
| software library                       | biblioteca de software                                              |   |
| SW - sofware                           | -                                                                   |   |
| HW - hardware                          | -                                                                   |   |
| Standardization committee              | Comitê de padronização                                              |   |
| Standardization body                   | Comitê de padronização, similar ao comitê ISO.                      |   |
|                                        |                                                                     |   |
|----------------------------------------+---------------------------------------------------------------------+---|
| *Data Structures*                        |                                                                     |   |
|----------------------------------------+---------------------------------------------------------------------+---|
| algorithm                              | algoritimo                                                          |   |
| array                                  |                                                                     |   |
| string                                 | cadeia de caracteres                                                |   |
| stack                                  | pilha                                                               |   |
| queue                                  | fila                                                                |   |
| linked list                            | lista encadeada                                                     |   |
| priority queue                         | fila de prioridades                                                 |   |
| tree                                   | arvore                                                              |   |
| binary tree                            | arvore binária                                                      |   |
| task queue                             | fila de tarefas                                                     |   |
| job queue                              | fila de tarefas ou fila de trabalhos                                |   |
| message queue                          | fila de mensagens                                                   |   |
|                                        |                                                                     |   |
|----------------------------------------+---------------------------------------------------------------------+---|
| *Miscellaneous*                          |                                                                     |   |
|----------------------------------------+---------------------------------------------------------------------+---|
| To debug                               | depurar                                                             |   |
| Operator overloading                   | sobrecarga de operadores                                            |   |
| Method overriding                      | Sobreposição de método                                              |   |
| Override a method                      | Sobrepor um método de uma classe                                    |   |
| Exception handling                     | tratamento de exceções                                              |   |
| Exception handler                      | tratador de exceções, código que trata exceção                      |   |
| Event handler                          | tratador de eventos                                                 |   |
| Event handling                         | tratamento de eventos                                               |   |
| Callback                               | função suprida pelo usuário que será chamada depois pelo framework. |   |
|                                        |                                                                     |   |
| Abstraction Layer                      | Camada de abstração                                                 |   |
| HAL - Hardware Abstraction Layer       | Camada de abstração de hardware                                     |   |
| TLS - Transport Layer Security         | Camada de segurança de transporte                                   |   |
| SSL - Secure Socket Layer              | Camada de segurança de socket                                       |   |
| Network Layer   (network)              | Camada de rede                                                      |   |
| Transport layer (network)              | Camada de transporte                                                |   |
|                                        |                                                                     |   |
| Sign in                                | Logar, entrar com username e senha.                                 |   |
| Sign up                                | Registrar-se pela primeira vez.                                     |   |
| Hosting                                | Hospedagem                                                          |   |
| Web Hosting                            | Hospedagem Web                                                      |   |
| IAM - Identity and access management   | Gerenciamento de identidade e acesso                                |   |
| ACL - Access Control List              | Lista de Acesso de Controle                                         |   |
| private key                            | chave privada                                                       |   |
| public key                             | chave pública                                                       |   |
| drop-in-replacement                    | -                                                                   |   |
| Control Theory                         | Teoria de controle ou Teoria de Controlo                            |   |
| Computational methods                  | Métodos computacionais                                              |   |
| Machine design                         | Projeto de máquinas                                                 |   |
| Embedded Systems                       | Sistemas embarcados                                                 |   |
| Firmware                               | software de sistemas embarcados                                     |   |
| ECU - Engine Control Unit              | Unidade de Controle de Motor                                        |   |
| Off-the-shelf components               | Componentes já prontos disponíveis no mercado                       |   |
| COTS - Commercial-Off-the-shelf        | -                                                                   |   |
| OEM - Original Equipment Manafucaturer | Fabricante de equipamento original                                  |   |
|                                        |                                                                     |   |
| bus                                    | barramento                                                          |   |
| PCI bus                                | barramento PCI                                                      |   |
| USB bus (Universal Serial Bus)         | barramento serial universal                                         |   |
|----------------------------------------+---------------------------------------------------------------------+---|
|----------------------------------------+---------------------------------------------------------------------+---|
| *Finace-Related*                         |                                                                     |   |
|----------------------------------------+---------------------------------------------------------------------+---|
| monetary policy                        | política monetária                                                  |   |
| fiscal policy                          | política fiscal                                                     |   |
| CPI - Consumer Price Index             | Índice de Preços ao Consumidor (indicador de inflação)              |   |
| exchange rate                          | taxa de câmbio                                                      |   |
| interest rate                          | taxa de juros                                                       |   |
| clearing house                         | casa de liquidação e custódia                                       |   |
| balance sheet                          | demonstrativo financeiro: balancete ou balanço patrimonial          |   |
| cash flow statement                    | demonstrativo de fluxo de caixa                                     |   |
| net worth                              | patrimônio líquido                                                  |   |
| saving account                         | conta poupança                                                      |   |
| checking account                       | conta corrente                                                      |   |
| assets                                 | ativos em contabilidade                                             |   |
| liabilities                            | passivos ou obrigações em contabilidade                             |   |
| equity                                 | patrimônio líquido, capital próprio                                 |   |
| ROI - Return On Investment             | Retorno no investmento                                              |   |
| revenue                                | receita                                                             |   |
| net revenue                            | receita liquida                                                     |   |
|                                        |                                                                     |   |
|----------------------------------------+---------------------------------------------------------------------+---|
