Roesetta_Stone_Translation.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-08-26 Thu 14:31 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Rosetta Stone - English/Portuguese Technical Terminology</title>
<meta name="generator" content="Org mode" />
<meta name="description" content="Dictionary about English/Portuguese technical terminology organized by topic."
 />
<meta name="viewport" content="width=device-width, minimum-scale=1.0, maximum-scale=1.0" />
<link href="theme/org-nav-theme.css" rel="stylesheet">
<link rel="icon" href="favicon.ico" type="image/vnd.microsoft.icon" />
</head>
<body>
<div id="content">
<h1 class="title">Rosetta Stone - English/Portuguese Technical Terminology</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org60af22a">1. Technical Terminology - English/Portuguese</a></li>
</ul>
</div>
</div>

<div id="outline-container-org60af22a" class="outline-2">
<h2 id="org60af22a"><span class="section-number-2">1</span> Technical Terminology - English/Portuguese</h2>
<div class="outline-text-2" id="text-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">English</th>
<th scope="col" class="org-left">Portuguese</th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">kernel</td>
<td class="org-left">núcleo ou núcleo de sistema operacional</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">software library</td>
<td class="org-left">biblioteca de software</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">SW - sofware</td>
<td class="org-left">-</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">HW - hardware</td>
<td class="org-left">-</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Standardization committee</td>
<td class="org-left">Comitê de padronização</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Standardization body</td>
<td class="org-left">Comitê de padronização, similar ao comitê ISO.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><b>Data Structures</b></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">algorithm</td>
<td class="org-left">algoritimo</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">array</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">string</td>
<td class="org-left">cadeia de caracteres</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">stack</td>
<td class="org-left">pilha</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">queue</td>
<td class="org-left">fila</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">linked list</td>
<td class="org-left">lista encadeada</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">priority queue</td>
<td class="org-left">fila de prioridades</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">tree</td>
<td class="org-left">arvore</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">binary tree</td>
<td class="org-left">arvore binária</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">task queue</td>
<td class="org-left">fila de tarefas</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">job queue</td>
<td class="org-left">fila de tarefas ou fila de trabalhos</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">message queue</td>
<td class="org-left">fila de mensagens</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><b>Miscellaneous</b></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">To debug</td>
<td class="org-left">depurar</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Operator overloading</td>
<td class="org-left">sobrecarga de operadores</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Method overriding</td>
<td class="org-left">Sobreposição de método</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Override a method</td>
<td class="org-left">Sobrepor um método de uma classe</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Exception handling</td>
<td class="org-left">tratamento de exceções</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Exception handler</td>
<td class="org-left">tratador de exceções, código que trata exceção</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Event handler</td>
<td class="org-left">tratador de eventos</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Event handling</td>
<td class="org-left">tratamento de eventos</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Callback</td>
<td class="org-left">função suprida pelo usuário que será chamada depois pelo framework.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Abstraction Layer</td>
<td class="org-left">Camada de abstração</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">HAL - Hardware Abstraction Layer</td>
<td class="org-left">Camada de abstração de hardware</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">TLS - Transport Layer Security</td>
<td class="org-left">Camada de segurança de transporte</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">SSL - Secure Socket Layer</td>
<td class="org-left">Camada de segurança de socket</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Network Layer   (network)</td>
<td class="org-left">Camada de rede</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Transport layer (network)</td>
<td class="org-left">Camada de transporte</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Sign in</td>
<td class="org-left">Logar, entrar com username e senha.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Sign up</td>
<td class="org-left">Registrar-se pela primeira vez.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Hosting</td>
<td class="org-left">Hospedagem</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Web Hosting</td>
<td class="org-left">Hospedagem Web</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">IAM - Identity and access management</td>
<td class="org-left">Gerenciamento de identidade e acesso</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">ACL - Access Control List</td>
<td class="org-left">Lista de Acesso de Controle</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">private key</td>
<td class="org-left">chave privada</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">public key</td>
<td class="org-left">chave pública</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">drop-in-replacement</td>
<td class="org-left">-</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Control Theory</td>
<td class="org-left">Teoria de controle ou Teoria de Controlo</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Computational methods</td>
<td class="org-left">Métodos computacionais</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Machine design</td>
<td class="org-left">Projeto de máquinas</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Embedded Systems</td>
<td class="org-left">Sistemas embarcados</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Firmware</td>
<td class="org-left">software de sistemas embarcados</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">ECU - Engine Control Unit</td>
<td class="org-left">Unidade de Controle de Motor</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Off-the-shelf components</td>
<td class="org-left">Componentes já prontos disponíveis no mercado</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">COTS - Commercial-Off-the-shelf</td>
<td class="org-left">-</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">OEM - Original Equipment Manafucaturer</td>
<td class="org-left">Fabricante de equipamento original</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">bus</td>
<td class="org-left">barramento</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PCI bus</td>
<td class="org-left">barramento PCI</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">USB bus (Universal Serial Bus)</td>
<td class="org-left">barramento serial universal</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><b>Finace-Related</b></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">monetary policy</td>
<td class="org-left">política monetária</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">fiscal policy</td>
<td class="org-left">política fiscal</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">CPI - Consumer Price Index</td>
<td class="org-left">Índice de Preços ao Consumidor (indicador de inflação)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">exchange rate</td>
<td class="org-left">taxa de câmbio</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">interest rate</td>
<td class="org-left">taxa de juros</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">clearing house</td>
<td class="org-left">casa de liquidação e custódia</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">balance sheet</td>
<td class="org-left">demonstrativo financeiro: balancete ou balanço patrimonial</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">cash flow statement</td>
<td class="org-left">demonstrativo de fluxo de caixa</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">net worth</td>
<td class="org-left">patrimônio líquido</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">saving account</td>
<td class="org-left">conta poupança</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">checking account</td>
<td class="org-left">conta corrente</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">assets</td>
<td class="org-left">ativos em contabilidade</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">liabilities</td>
<td class="org-left">passivos ou obrigações em contabilidade</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">equity</td>
<td class="org-left">patrimônio líquido, capital próprio</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">ROI - Return On Investment</td>
<td class="org-left">Retorno no investmento</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">revenue</td>
<td class="org-left">receita</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">net revenue</td>
<td class="org-left">receita liquida</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2021-08-26 Thu 14:31</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
